{
  "footerFootnote": "TODO.",
  "legalInformationLabel": "",
  "legalInformationLink": "",
  "pageHelp": {
    "headlinePrefix": "How to use the",
    "paragraphs": [
      {
        "headline": "Introduction",
        "values": [
          "Technology is moving fast and new technologies and innovations appear continuously.",
          "It's essential for a development and technology company such as AOE to constantly improve and keep track with the latest useful innovations. It is important to openly look for innovations and new technologies and to question established technologies and methods every now and then.",
          "But, it is also important to wisely choose which technologies to use in our daily work and in the different projects we are carrying out. As we all know: There is no silver bullet."
        ]
      },
      {
        "headline": "What is the AOE Technology Radar",
        "values": [
          "The Tech Radar is an overview of different technologies - from languages, frameworks, tools and patterns to platforms - that we consider \"new or mentionable\". The radar therefore doesn't provide an overview of all established technologies - but it focuses on items that have recently gained in importance or changed."
        ]
      },
      {
        "headline": "How it is created",
        "values": [
          "The items in the technology radar are raised by the different teams and therefore a lot of the items are related to the work and challenges the teams face in the different projects. In fact, we don't include anything on the radar, which we haven't already tried ourselves at least once.",
          "There have been a lot of valuable discussions in different expert groups about the classification and details of each of technologies and innovations. And the result of all this can be found in the latest technology radar."
        ]
      },
      {
        "headline": "How should it be used",

        "values": [
          "The radar acts as an overview of technologies that we think everyone in the teams should currently know about.",
          "Its goal is to act as a guide and inspiration for the daily work in the teams. Its purpose is also to provide helpful information and a bird's-eye perspective - so that decisions can be taken with a much deeper understanding of the subject matter. This results in more-informed and better-aligned decisions.",
          "We also hope that developers outside of AOE find the information in our technology overview inspirational.",
          "We group or categorize the items in 4 quadrants - (sometimes, when it's not 100% clear where a item belongs, we choose the best fit)."
        ]
      }
    ],
    "quadrants": [
      {
        "description": "Specialism. The vertical part of the T",
        "name": "Deep Discipline Expertise"
      },
      {
        "description": "The horizontal part of the T",
        "name": "Cross Discipline Expertise"
      },
      {
        "description": "Tools and patterns that you use within your job role but which don't necessarily fall under your main job role but contribute to your effectiveness within the organisation.",
        "name": "Personal Effectiveness"
      },
      {
        "description": "Taking a holistic approach to personal development and allowing folks to put more personal goals/tools/practices in here.",
        "name": "Everything Else..."
      }
    ],
    "quadrantsPreDescription": "The quadrants are:",
    "rings": [
      {
        "description": "Technologies and practices that I have used heavily, that excite me and I'd like to continue to use.",
        "name": "Adopt"
      },
      {
        "description": "Technologies and Practices which I have an interest in and an awareness of.  I'd like to grow my experience in these areas.",
        "name": "Trial"
      },
      {
        "description": "These are technologies or practices which I find promising - almost a todo list for future learning.",
        "name": "Backburner"
      },
      {
        "description": "This category is a bit special. These are things that I have had previous exposure to but wouldn't use either as there are better alternatives or they don't/no longer excite me.",
        "name": "Hold"
      }
    ],
    "ringsPreDescription": "Each of the items is classified in one of these rings:",
    "sourcecodeLink": {
      "description": "Contributions and source code of the Personal Tech Radar are on github:",
      "href": "https://github.com/stephenjgray/aoe_technology_radar",
      "name": "Personal Tech Radar on Github"
    }
  },
  "pageIndex": {
    "publishedLabel": "Quadrant Overview"
  },
  "pageItem": {
    "quadrantOverview": "Quadrant Overview"
  },
  "pageOverview": {
    "title": "Technologies Overview"
  },
  "revisionsText": "Revisions:",
  "searchLabel": "Search",
  "searchPlaceholder": "What are you looking for?",
  "socialLinks": [
    {
      "href": "#",
      "iconName": "twitter"
    },
    {
      "href": "#",
      "iconName": "linkedIn"
    },
    {
      "href": "#",
      "iconName": "instagram"
    },
    {
      "href": "#",
      "iconName": "github"
    }
  ],
  "socialLinksLabel": "Follow me:"
}
