{
  "items": [
    {
      "flag": "default",
      "featured": true,
      "name": "react",
      "title": "React.js",
      "ring": "adopt",
      "quadrant": "deep-discipline-expertise",
      "body": "<p>The past months have shown that React is still a great fit for us for frontend-heavy\napplications. With its rewritten core in version 16, Facebook shows how\nimportant this framework is for them. Therefore, Facebook is investing a lot of effort into React and a\nhealthy community. In addition, we <strong>REALLY</strong> enjoy writing React\ncomponents – so much so, that we have to move this library into <strong>adopt</strong>!</p>\n",
      "info": "",
      "release": "2018-03-01",
      "fileName": ""
    },
    {
      "flag": "changed",
      "featured": true,
      "name": "rxjs",
      "title": "RxJs",
      "ring": "backburner",
      "quadrant": "deep-discipline-expertise",
      "body": "<p>RX/JS aka reactive streams</p>\n<p>RxJS is an implementation for the reactive programming paradigm which implements mostly the observer and iterator\npattern and follows the functional programming ideas. The pattern actually got a renaissance because it&#39;s not completely\nnew but has new implementations in many frameworks and languages like Angular, Akka, Spring and many more. Reason for \nthat attention actually is (in the javascript world), that observables can be cancelled (by rules too) and  observables\ncan pass (stream) data on multiple events. Both aspects are not well realizable using promises e.g. and both were also\ndetected as a huge limitation in the JavaScript community — and so it&#39;s worth to get an understanding for reactive\nprogramming in general.</p>\n<p>We at AOE actually use RxJS in combination with Angular and can fully recommend the approach of observables.</p>\n",
      "info": "",
      "release": "2021-01-01",
      "fileName": ""
    },
    {
      "flag": "default",
      "featured": true,
      "name": "sass",
      "title": "SASS",
      "ring": "adopt",
      "quadrant": "deep-discipline-expertise",
      "body": "<p>SASS (Syntactically Awesome Style-Sheets) is an extension to native CSS, which, as a preprocessor, simplifies the generation of CSS by offering features that enable developers to more efficiently write robust, better readable and maintainable CSS.</p>\n<p>Core features of SASS are:</p>\n<ul>\n<li>  Nesting of rules: CSS rules can be indented, reducing redundancy of selectors and increasing readability due to shorter selectors.</li>\n<li>  Use of variables: Commonly-used values such as colors can be stored in variables</li>\n<li>  Mixins: Often-used CSS blocks can be referenced by using mixins, which work like functions</li>\n<li>  Extends: CSS properties can be inherited</li>\n<li>  SASS files can be split into modules, which leads to smaller files and better file structures</li>\n<li>  Operators: Simple math calculations can be applied to CSS properties</li>\n<li>  Easily to integrate in nodejs-environments and build tools such s <a href=\"/techradar/tools/npm.html\">NPM</a>, <a href=\"/techradar/tools/gulp.html\">Gulp</a> and <a href=\"/techradar/tools/grunt.html\">Grunt</a>.</li>\n</ul>\n<p>SASS has been widely adopted for many years and has evolved to an industry-standard backed by an active community since 2006.</p>\n<p>The learning curve is very smooth as SASS is fully compatible to CSS, meaning that all features are optional: Starting with SASS is as easy as renaming .css-files to .scss in a first step and then refactoring it step-by-step with the use of SASS features.</p>\n<p>At AOE, SASS has been recommended by the frontend COI and is used in nearly every current project.</p>\n<p>More information:</p>\n<ul>\n<li>  <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"http://sass-lang.com/\">SASS Language</a></li>\n<li>  <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"http://sassdoc.com/\">SASSDoc</a></li>\n<li>  <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://www.theguardian.com/info/developer-blog/2014/may/13/improving-sass-code-quality-on-theguardiancom\">Improving Sass code quality on</a> <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"http://theguardian.com\">theguardian.com</a></li>\n</ul>\n",
      "info": "TEST",
      "release": "2017-03-01",
      "fileName": ""
    }
  ],
  "releases": ["2017-03-01", "2018-03-01", "2019-11-01", "2021-01-01"]
}
